{
  "title": {
    "about": "About",
    "annotatedCorpus": "Annotated Corpus",
    "articles": "Papers",
    "bioNLP": "BioNER",
    "corpus": "Corpus",
    "customSearch": "Text Search",
    "code": "Code",
    "graphDB": "RDF",
    "home": "Home",
    "jupiterNotebooks": "Notebooks",
    "keyQ": "KeyQ",
    "knowledgeGraph": "Knowledge Graph",
    "oeg": "Ontology Engineering Group (OEG)",
    "ontology": "Ontology",
    "qa": "BioQA",
    "queryBuilder": "Repository",
    "resources": "Resources",
    "searchEngine": "BioSearch",
    "services": "Services",
    "sparql": "SPARQL"
  },

  "label": {
    "type": "Type",
    "confidence": "Confidence",
    "version": "Version",
    "and": "and",
    "filterBy": "Filter by",
    "goTo": "Go to"
  },

  "month": {
    "1": "Jan",
    "2": "Feb",
    "3": "Mar",
    "4": "Apr",
    "5": "May",
    "6": "Jun",
    "7": "Jul",
    "8": "Aug",
    "9": "Sep",
    "10": "Oct",
    "11": "Nov",
    "12": "Dec"
  },

  "footer": {
    "sponsor": "With the financial support of",
    "caption": "Drugs4Covid++ - AYUDAS FUNDACIÓN BBVA A EQUIPOS DE INVESTIGACIÓN CIENTÍFICA SARS-CoV-2 y COVID-19"
  },

  "home": {
    "header": "We created a knowledge graph with evidence from scientific publications on coronaviruses. Drugs, diseases, genes and proteins are identified and normalised to enable complex searches on the articles.",
    "subheader": "Drugs4Covid extracts and structures evidence from scientific papers in five steps: Harvest, Parse, Extract, Integrate, and Publish. Try out our public tools.",
    "section1": {
      "title": "Harvest",
      "text": "Data are collected at this stage. We use reliable information sources to retrieve scientific articles on coronaviruses. <strong>The CORD-19 corpus</strong> has been the main database used in this study. The latest indexed update is the January 2022 edition, with 334,572 scientific articles and more than 7 million paragraphs.",
      "btnText": "Go to Corpus"
    },
    "section2": {
      "title": "Parse",
      "text": "One of the most fundamental text mining tasks in information retrieval in medical domain is the recognition of biomedical entities, such as <strong>diseases, chemicals or genes</strong>, commonly known as BioNER. As a complement to this recognition, we have linked the detected entities to <strong>curated databases</strong> in a process called BioNEN entity linking or normalisation.",
      "btnText": "Go to BioNER"
    },
    "section3": {
      "title": "Extract",
      "text": "The combined use of natural language processing tasks with word representation techniques and knowledge extraction technologies provides practitioners and clinical researchers with tools that facilitate their work in structuring the information contained in the articles. In particular, to establish relationships between drugs or diseases, and in order to improve corpus searches, we have created representation models based on <strong>probabilistic topics</strong> capable of abstracting entities from their textual forms and relating them to each other.",
      "btnText": "Go to BioSearch"
    },
    "section4": {
      "title": "Integrate",
      "text": "In order to address the challenge of integrating biomedical knowledge into a single representation space that also provides traceability, we have created the <strong>EBOCA ontology</strong> where the Evidence for BiOmedical Concept Association is modelled.  The ontology describes and associates concepts from the biomedical domain, as well as the evidence that supports these associations. With this ontology we define the conceptual model on which the Drugs4Covid knowledge graph is built.",
      "btnText": "Go to EBOCA"
    },
    "section5": {
      "title": "Publish",
      "text": "We have created a <strong>hybrid question-answer (QA)</strong> system based on natural language that provides answers by combining information from knowledge graphs and text documents. It is a novel KGQA algorithm that works without prior training and without the need to translate the question into a formal query language.",
      "btnText": "Go to BioQA"
    }
  },

  "services": {
    "title": "@:title.services",
    "header": "This is a list of services available in our webpage",
    "bioNER": {
      "title": "@:title.bioNLP",
      "subtitle": "@:bioNLPView.subtitle",
      "text": "A biomedical named entity recognizer (NER) that normalizes (NEN) the drugs, diseases, genes and proteins mentioned in texts with the codes of the main standardization systems such as MeSH, ICD-10, ATC, SNOMED, ChEBI, GARD and NCBI. It is based on fine-tuning the BioBERT language model independently for each entity type using domain-specific datasets and an inverse index search to normalize the references.",
      "btnText": "Start Analyzing"
    },
    "bioSearch": {
      "title": "@:title.searchEngine",
      "subtitle": "@:searchEngineView.subtitle",
      "text": "An open web service to exploit the existing scientific literature about coronavirus identifying drugs, diseases and articles and displaying their relations inside the corpus. You can search by ATC code, Generic Name, Disease Name or MESH code.",
      "btnText": "Start Searching"
    },
    "bioQA": {
      "title": "@:title.qa",
      "subtitle": "@:qaView.subtitle",
      "text": "A novel <strong>Question-Answering (QA) system</strong> based on natural language questions that is domain-independent and enables the combination of knowledge graphs with unstructured information sources to build the answer. It combines <strong>DBPedia</strong> and <strong>Wikidata</strong> with the Drugs4Covid database to provide natural language answers.",
      "btnText": "Start Asking"
    }
  },

  "knowledgeGraph": {
    "title": "Knowledge Graph",
    "header": "header",
    "rdf": {
      "title": "RDF",
      "text": "The Drugs4Covid Knowledge Graph uses two declarative mapping languages to transform input data into RDF: the W3C Recommendation R2RML for EBOCA SEM-DISNET, and RML for EBOCA Evidences. Both mappings have been created using Mapeathor ans were materialized using the mapping engine Morph-KGC.",
      "btnText": "@:label.goTo Repository"
    },
    "sparql": {
      "title": "SPARQL",
      "text": "A web interface based on the <strong>HELIO framework</strong> has been created to access the Drugs4Covid knowledge graph. It enables queries in SPARQL format and manages access to resources through its URIs.",
      "btnText": "@:label.goTo SPARQL Endpoint"
    }
  },

  "corpus": {
    "title": "",
    "header": "",
    "textSearch": {
      "title": "Text Search",
      "text": "We exploit the entity recognition models and the probabilistic topic representations of Drugs4Covid to provide a <strong>search engine</strong> based on biomedical entities. Additional databases have been used to extend the drug information and relate it to other terms. \n",
      "btnText": "Start Searching"
    },
    "repository": {
      "title": "Repository",
      "text": "Supported by Solr, we have created indexes for each of the biomedical entities that can provide evidence",
      "btnDiseases": "Diseases",
      "btnDrugs": "Drugs",
      "btnGenes": "Genes and Proteins",
      "btnPapers": "Papers",
      "btnParagraphs": "Paragraphs"
    },
    "keyQ": {
      "title": "Key",
      "text": "",
      "btnText": "@:label.goTo KeyQ"
    }
  },

  "resources": {
    "title": "Resources",
    "header": "header",
    "code": {
      "title": "Code",
      "text": "All resources created on Drugs4Covid are open source and publicly available. We have created an organisation on Github to centralise them. Feel free to use them and leave us feedback to help us keep improving.",
      "btnText": ""
    },
    "notebooks": {
      "title": "Notebooks",
      "text": "To facilitate the use of our resources and speed up proof-of-concept testing, we have also created <strong>Jupyter notebooks</strong> that are openly available",
      "sources": {
        "cord19Indexing": {
          "title": "CORD-19 Indexing",
          "description": "Clean-up and text preparation tasks for indexing CORD-19 articles in Solr"
        },
        "atcProcessing": {
          "title": "ATC Processing",
          "description": "Retrieve drug information from the ATC system in Solr"
        },
        "meshProcessing": {
          "title": "MeSH Processing",
          "description": "Retrieve drug and disease information from the MeSH system in Solr"
        }
      }
    },
    "annotatedCorpus": {
      "title": "Annotated Corpus",
      "text": "We have created a biomedical corpus in Spanish with twelve <strong>biomedical</strong> entities (Disease/Syndrome, Gene, Body Part/Organ, Glucid, Diagnostic Procedure, Protein, Therapeutic Procedure, Symptom/Sign, Pharmacological Substance, Lipid, Organism and Organic Chemical), one <strong>linguistic</strong> entity (Abbreviation/Sigla/Alias) and seven <strong>semantic relations</strong> (analyzes, alters, causes, diagnoses, manifestation_of, produces, refers_to, and treats). In total, 200 clinical reports were annotated, and 6636 biomedical entities and 4864 semantic relations were manually identified",
      "btnText": "@:label.goTo Zenodo"
    }
  },

  "textSearch": {
    "title": "Keyword-guided Resource Finder",
    "subtitle": "Type one or more keywords and select the resource to retrieve: text, medicine or disease.",
    "placeholder": "Remdesivir",
    "subheader1": "Max Results",
    "subheader2": "Resources",
    "subheader3": "Filters",
    "diseases": "Diseases",
    "drugs": "Drugs",
    "texts": "Texts",
    "drugsFilter": "@:label.filterBy ATC level",
    "diseasesFilter": "@:label.filterBy MESH level"
  },

  "bioNLPView": {
    "title": "@:title.bioNLP",
    "subtitle": "Find the biomedical entities hidden in text",
    "placeholder": "Place some text to start analyzing",
    "description": "BioNER tool which aims to apply last state of the art models for the recognition of Biomedical Entities: Diseases, Chemicals and Genetical ents.",
    "resultsTitle": "Results",
    "tableTitles": {
      "disease": "Diseases",
      "chemicals": "Drugs/Chemicals",
      "genetics": "Genetics",
      "covid": "COVID-19"
    },
    "tableHeaders": {
      "term": "Term",
      "foundTerm": "Found Term",
      "meshId": "Mesh ID",
      "cui": "CUI",
      "icd10": "ICD10",
      "crossReferences": "Other IDs",
      "semanticType": "Semantic Type",
      "chebiId": "CHEBI ID",
      "atc": "ATC",
      "atcLevel": "ATC Level",
      "cid": "CID",
      "ncbiGeneId": "NCBIgene ID",
      "uniprotId": "UniProt ID",
      "ncbiTaxonId": "NCBItaxon ID",
      "ebiReference": "EBI Reference",
      "evidence": "Evidence",
      "target": "Target",
      "associationScore": "COVID-19 Association Score",
      "prId": "PR ID"

    }
  },

  "qaView": {
    "title": "@:title.qa",
    "subtitle": "Make any question to our engine and select the number of answers",
    "placeholder": "Write a question",
    "maxAnswers": "Max Answers"
  },

  "searchEngineView": {
    "title": "@:title.searchEngine",
    "subtitle": "Search among all scientific literature about coronavirus",
    "placeholder": "Type at least {numChar} characters to start searching"
  },
  "about": {
    "title": "@:title.oeg",
    "team": "Our Team",
    "subtitle": "@:about.lab <br> @:about.faculty <br> @:about.university <br> @:about.address",
    "lab": "Laboratory 3206",
    "faculty": "Escuela Técnica Superior de Ingenieros Informáticos (ETSIINF)",
    "university": "Polytechnic University of Madrid",
    "address": "Avda. Montepríncipe, s/n, Boadilla del Monte, 28660, Spain"
  }
}