{
  "lang": {
    "es": "Español",
    "en": "Inglés"
  },

  "label": {
    "and": "y",
    "confidence": "Confianza",
    "filterBy": "Filtrar por",
    "goTo": "Ir a",
    "type": "Tipo",
    "version": "Versión",
    "unpublished": "Unpublished Article"
  },

  "error": {
    "validation": {
      "required": "Este campo es obligatorio",
      "outOfRange": "El valor debe estar entre {min} y {max}",
      "tooManyTerms": "Sólo se pueden seleccionar {value} términos de manera simultánea. Por favor, deseleccione un término antes de continuar."
    }
  },

  "month": {
    "1": "Ene",
    "2": "Feb",
    "3": "Mar",
    "4": "Abr",
    "5": "Mayo",
    "6": "Jun",
    "7": "Jul",
    "8": "Ago",
    "9": "Sep",
    "10": "Oct",
    "11": "Nov",
    "12": "Dic"
  },

  "nav": {
    "about": "Acerca de",
    "annotatedCorpus": "Corpus Anotado",
    "bioNER": "@:bioNER.title",
    "bioQA": "@:bioQA.title",
    "bioSearch": "@:bioSearch.title",
    "code": "Código",
    "corpus": "@:corpus.title",
    "home": "Inicio",
    "keyQ": "KeyQ",
    "knowledgeGraph": "@:knowledgeGraph.title",
    "notebooks": "Cuadernos de Trabajo",
    "ontology": "Ontología",
    "papers": "Publicaciones",
    "rdf": "RDF",
    "platform_es": "@:platform_es.title",
    "repository": "Repositorio",
    "resources": "@:resources.title",
    "services": "@:services.title",
    "sparql": "SPARQL",
    "textSearch": "Búsqueda Textual"
  },

  "footer": {
    "sponsor": "Con el apoyo financiero de",
    "caption": "Drugs4Covid++ - AYUDAS FUNDACIÓN BBVA A EQUIPOS DE INVESTIGACIÓN CIENTÍFICA SARS-CoV-2 y COVID-19"
  },

  "home": {
    "header": "Hemos creado un grafo de conocimientos con evidencias sobre coronavirus extraídas de publicaciones científicas. Los fármacos, las enfermedades, los genes y las proteínas se identifican y normalizan para permitir búsquedas complejas en los artículos.",
    "subheader": "Drugs4Covid procesa artículos científicos en cinco pasos: Recogida, Análisis, Extracción, Integración y Publicación. Nuestras herramientas están disponibles para que puedas utilizarlas.",
    "section1": {
      "title": "Recogida",
      "text": "    Utilizamos fuentes de información fiables para recopilar artículos científicos sobre coronavirus. El <strong>corpus CORD-19</strong> ha sido la principal base de datos utilizada en este estudio, con más 400 mil artículos científicos y 7 millones de párrafos.",
      "btnText": "Ir al corpus"
    },
    "section2": {
      "title": "Análisis",
      "text": "Una de las tareas de minería de texto críticas en la recuperación de información en el ámbito clínico es el reconocimiento de entidades biomédicas. Se identifican <strong>enfermedades, sustancias químicas o genes</strong>, y comúnmente se conoce a esta tarea como BioNER. Como complemento a este reconocimiento, hemos vinculado las entidades detectadas a <strong>bases de datos curadas</strong> en un proceso denominado normalización de entidades o BioNER.",
      "btnText": "Ir a BioNER"
    },
    "section3": {
      "title": "Extraccion",
      "text": "El uso combinado de tareas de procesamiento del lenguaje natural con técnicas de representación de palabras y tecnologías de extracción de conocimiento proporciona a los profesionales e investigadores clínicos herramientas que facilitan su trabajo de estructuración de la información contenida en los artículos. En particular, para establecer relaciones entre fármacos y enfermedades, y con el fin de mejorar las búsquedas en los corpus, hemos creado modelos de representación basados en <strong>tópicos probabilísticos</strong> capaces de abstraer las entidades y descubrir relaciones entre ellas.",
      "btnText": "Ir a BioSearch"
    },
    "section4": {
      "title": "Integración",
      "text": "Para afrontar el reto de organizar el conocimiento biomédico en un único espacio de representación que además proporcione evidencias, hemos creado la <strong>ontología EBOCA</strong> que modela la asociación de conceptos Biomédicos. La ontología describe y asocia medicamentos, enfermedades, síntomas y sustancias químicas, así como las evidencias que soportan asociaciones entre ellos. Con esta ontología definimos el modelo conceptual sobre el que se construye el grafo de conocimientos de Drugs4Covid.",
      "btnText": "Ir a EBOCA"
    },
    "section5": {
      "title": "Publicar",
      "text": "Hemos creado un sistema <strong>híbrido de pregunta-respuesta (QA)</strong> basado en lenguaje natural que proporciona respuestas combinando información estructurada en grafos de conocimientos con documentos de textos. Se trata de un novedoso algoritmo KGQA que no requiere entrenamiento previo sobre la base de conocimiento, ni utiliza un lenguaje formal de consulta para extraer las respuestas.",
      "btnText": "Ir a BioQA"
    }
  },

  "services": {
    "title": "Servicios",
    "header": "Este es un listado de los servicios disponibles en nuestra página web",
    "bioNER": {
      "title": "@:bioNER.title",
      "subtitle": "@:bioNER.subtitle",
      "text": "Un reconocedor de entidades con nombre (NER) biomédico que normaliza (NEN) los fármacos, enfermedades, genes y proteínas mencionados en los textos con los códigos de los principales sistemas de estandarización como MeSH, ICD-10, ATC, SNOMED, ChEBI, GARD y NCBI. Se basa en el ajuste del modelo lingüístico de BioBERT de forma independiente para cada tipo de entidad utilizando conjuntos de datos específicos del dominio y una búsqueda de índice inversa para normalizar las referencias.",
      "btnText": "Empezar a analizar"
    },
    "bioSearch": {
      "title": "@:bioSearch.title",
      "subtitle": "@:bioSearch.subtitle",
      "text": "Un servicio web abierto para explotar la literatura científica existente sobre coronavirus identificando fármacos, enfermedades y artículos y mostrando sus relaciones dentro del corpus. Se puede buscar por código ATC, nombre genérico, nombre de la enfermedad o código MESH.",
      "btnText": "Empezar a buscar"
    },
    "bioQA": {
      "title": "@:bioQA.title",
      "subtitle": "@:bioQA.subtitle",
      "text": "Un novedoso <strong>sistema de respuesta a preguntas (QA</strong> ) basado en preguntas en lenguaje natural que es independiente del dominio y permite la combinación de grafos de conocimiento con fuentes de información no estructuradas para construir la respuesta. Combina <strong>DBPedia</strong> y <strong>Wikidata</strong> con la base de datos Drugs4Covid para proporcionar respuestas en lenguaje natural.",
      "btnText": "Empezar a preguntar"
    }
  },

  "bioNER": {
    "title": "Bio NER",
    "subtitle": "Encuentra las entidades biomédicas escodidas en el texto",
    "placeholder": "Introduce algún fragmento de texto para empezar a analizar",
    "description": "La herramienta BioNER aplica los ultimos modelos de reconocimiento de Entidades Biomèdicas: Enfermedades, Químicos, y Entidades Geneticas.",
    "resultsTitle": "Resultados",
    "tables": {
      "titles": {
        "disease": "Enfermedades",
        "chemicals": "Medicamentos/Químicos",
        "genetics": "Genéticos",
        "covid": "COVID-19"
      },
      "headers": {
        "associationScore": "COVID-19 Puntuación de Asociación",
        "atc": "ATC",
        "atcLevel": "Nivel ATC",
        "chebiId": "CHEBI ID",
        "cid": "CID",
        "crossReferences": "Otros IDs",
        "cui": "CUI",
        "ebiReference": "Referencia EBI",
        "evidence": "Evidencia",
        "foundTerm": "Término Encontrado",
        "icd10": "ICD10",
        "meshId": "Mesh ID",
        "ncbiTaxonId": "NCBItaxon ID",
        "ncbiGeneId": "NCBIgene ID",
        "prId": "PR ID",
        "semanticType": "Tipo Semántico",
        "target": "Objetivo",
        "term": "Término",
        "uniprotId": "UniProt ID"
      }
    }
  },

  "platform_es": {
    "title": "Plataforma",
    "subtitle": "Encuentra las entidades médicas en el texto y sus textos relacionados",
    "placeholder": "Introduce algún fragmento de texto para empezar a analizar",
    "description": "La herramienta BioNER aplica los ultimos modelos de reconocimiento de Entidades Biomèdicas: Enfermedades, Químicos, y Entidades Geneticas.",
    "resultsTitle": "Resultados",
    "entitiesTitle": "Entidades detectadas",
    "tables": {
      "titles": {
        "diseases": "Enfermedades",
        "chemicals": "Medicamentos/Químicos"
      },
      "headers": {
        "associationScore": "COVID-19 Puntuación de Asociación",
        "atc": "ATC",
        "atcLevel": "Nivel ATC",
        "chebiId": "CHEBI ID",
        "cid": "CID",
        "crossReferences": "Otros IDs",
        "cui": "CUI",
        "ebiReference": "Referencia EBI",
        "evidence": "Evidencia",
        "foundTerm": "Término Encontrado",
        "icd10": "ICD10",
        "meshId": "Mesh ID",
        "ncbiTaxonId": "NCBItaxon ID",
        "ncbiGeneId": "NCBIgene ID",
        "prId": "PR ID",
        "semanticType": "Tipo Semántico",
        "target": "Objetivo",
        "term": "Término",
        "uniprotId": "UniProt ID"
      }
    }
  },

  "bioSearch": {
    "title": "Bio Search",
    "subtitle": "Busque sobre coronavirus entre toda la literatura científica",
    "placeholder": "Escribe al menos {numChar} caracteres para empezar a buscar"
  },

  "bioQA": {
    "title": "Bio QA",
    "subtitle": "Realiza cualquier pregunta a nuestro motor QA y selecciona el número de respuestas",
    "placeholder": "Escribe una pregunta",
    "subheader1": "Respuestas Máximas",
    "subheader2": "Base de datos",
    "d4c": "D4C",
    "dbPedia": "DB Pedia",
    "wikidata": "Wikidata"
  },

  "knowledgeGraph": {
    "title": "Grafo de Conocimientos",
    "header": "",
    "rdf": {
      "title": "RDF",
      "text": "El Grafo de Conocimientos de Drugs4Covid utiliza dos lenguajes declarativos de mapeo para transformar los datos de entrada en tripletas RDF: R2RML para EBOCA SEM-DISNET y RML para EBOCA Evidences. Ambos mapeos se crearon con Mapeathor y se materializaron usando el motor de mapeo Morph-KGC.",
      "btnText": "Ir al Repositorio"
    },
    "sparql": {
      "title": "SPARQL",
      "text": "Se ha creado una interfaz web basada en el <strong>marco de trabajo HELIO</strong> para acceder al grafo de conocimientos de Drugs4Covid. Permite consultas SPARQL y gestiona el acceso a los recursos a través de sus URIs.",
      "btnText": "@:label.goTo SPARQL Endpoint"
    }
  },

  "corpus": {
    "title": "Corpus",
    "header": "",
    "textSearch": {
      "title": "Búsqueda Textual",
      "text": "A partir de los modelos de reconocimiento de entidades y las representaciones basadas en tópicos probabilísticos, hemos creado un <strong>motor de búsqueda documental</strong> basado en entidades biomédicas. Se han utilizado bases de datos adicionales para extender la información sobre medicamentos y relacionarla con otros términos.",
      "btnText": "Empezar a buscar"
    },
    "repository": {
      "title": "Repositorio",
      "text": "Soportado por Solr, hemos creado índices para cada una de las entidades biomédicas que pueden aportar evidencias.",
      "btnDiseases": "Diseases",
      "btnDrugs": "Medicamentos",
      "btnGenes": "Genes y Proteinas",
      "btnPapers": "Documenos",
      "btnParagraphs": "Parrafos"
    },
    "keyQ": {
      "title": "KeyQ",
      "text": "Explora el corpus a partir de la terminología extraída automáticamente de sus documentos.",
      "btnText": "@:label.goTo KeyQ"
    },
    "annotatedCorpus": {
      "title": "Corpus Anotado",
      "text": "Hemos creado un corpus clínico en español con doce <strong>entidades biomédicas</strong> (Enfermedad/Síndrome, Gen, Parte del Cuerpo/Órgano, Glúcido, Procedimiento Diagnóstico, Proteína, Procedimiento Terapéutico, Síntoma/Signo, Sustancia Farmacológica, Lípido, Organismo y Químico Orgánico), una <strong>entidad lingüística</strong> (Abreviatura/Sigla/Alias) y siete <strong>relaciones semánticas</strong> (analiza, altera, causa, diagnostica, manifestacion_de, produce, refiere_a y trata). En total, se anotaron 200 informes clínicos, y se identificaron manualmente 6.636 entidades biomédicas y 4.864 relaciones semánticas.",
      "btnText": "@:label.goTo Zenodo"
    }
  },

  "textSearch": {
    "title": "Buscador de recursos guiado por palabras clave",
    "subtitle": "Escriba una o más palabras clave y seleccione el recurso para recuperar: texto, medicina o enfermedad.",
    "placeholder": "Remdesivir",
    "subheader1": "Resultados Máximos",
    "subheader2": "Recursos",
    "subheader3": "Filtros",
    "diseases": "Enfermedades",
    "drugs": "Medicamentos",
    "texts": "Textos",
    "drugsFilter": "@:label.filterBy nivel ATC",
    "diseasesFilter": "@:label.filterBy nivel MESH",
    "tables": {
      "titles": {
        "drugs": "Medicamentos Relacionados",
        "diseases": "Enfermedades Relacionadas",
        "texts": "Textos Relacionados"
      },
      "headers": {
        "name": "Nombre",
        "code": "Código",
        "level": "Nivel",
        "frequency": "Frecuencia"
      }
    },
    "btnSource": "Ir a la Fuente"
  },

  "resources": {
    "title": "Herramientas",
    "header": "",
    "code": {
      "title": "Código Fuente",
      "text": "Todas las herramientas creadas en Drugs4Covid son de <strong>código abierto</strong> y están disponibles públicamente. Hemos creado una organización en GitHub para centralizarlos. Siéntete libre de usarlos y déjanos tus comentarios para ayudarnos a seguir mejorando.",
      "btnText": ""
    },
    "notebooks": {
      "title": "Cuadernos de Trabajo",
      "text": "Para facilitar el uso de nuestros recursos y acelerar las pruebas de concepto, también hemos creado <strong>cuadernos de trabajo en Jupyter</strong> que están disponibles en abierto.",
      "btnText": "@:label.goTo Notebooks",
      "sources": {
        "cord19Indexing": {
          "title": "CORD-19 Indexing",
          "description": "Tareas de limpieza y preparación de texto para indexar artículos CORD-19 en Solr."
        },
        "atcProcessing": {
          "title": "ATC Processing",
          "description": "Recuperar información de medicamentos del sistema ATC en Solr."
        },
        "meshProcessing": {
          "title": "MeSH Processing",
          "description": "Recuperar información de medicamentos y enfermedades del sistema MeSH en Solr."
        }
      }
    }
  },

  "about": {
    "title": "Ontology Engineering Group (OEG)",
    "team": "Quienes somos",
    "subtitle": "@:about.lab <br> @:about.faculty <br> @:about.university <br> @:about.address",
    "lab": "Laboratorio 3206",
    "faculty": "Escuela Técnica Superior de Ingenieros Informáticos (ETSIINF)",
    "university": "Universidad Politécnica de Madrid",
    "address": "Avda. Montepríncipe, s/n, Boadilla del Monte, 28660, Spain"
  }
}