{
  "label": {
    "and": "y",
    "confidence": "Confianza",
    "filterBy": "Filtrar por",
    "goTo": "Ir a",
    "type": "Tipo",
    "version": "Versión"
  },

  "error": {
    "validation": {
      "required": "Este campo es obligatorio",
      "outOfRange": "El valor debe estar entre {min} y {max}"
    }
  },

  "month": {
    "1": "Ene",
    "2": "Feb",
    "3": "Mar",
    "4": "Abr",
    "5": "Mayo",
    "6": "Jun",
    "7": "Jul",
    "8": "Ago",
    "9": "Sep",
    "10": "Oct",
    "11": "Nov",
    "12": "Dic"
  },

  "nav": {
    "about": "Acerca de",
    "annotatedCorpus": "Corpus anotado",
    "bioNER": "@:bioNER.title",
    "bioQA": "@:bioQA.title",
    "bioSearch": "@:bioSearch.title",
    "code": "Código",
    "corpus": "@:corpus.title",
    "home": "Inicio",
    "keyQ": "KeyQ",
    "knowledgeGraph": "Gráfico de conocimiento",
    "notebooks": "Cuadernos",
    "ontology": "Ontología",
    "papers": "Papeles",
    "rdf": "RDF",
    "repository": "Repositorio",
    "resources": "Recursos",
    "services": "@:services.title",
    "sparql": "SPARQL",
    "textSearch": "Búsqueda Textual"
  },

  "footer": {
    "sponsor": "Con el apoyo financiero de",
    "caption": "Drugs4Covid++ - AYUDAS FUNDACIÓN BBVA A EQUIPOS DE INVESTIGACIÓN CIENTÍFICA SARS-CoV-2 y COVID-19"
  },

  "home": {
    "header": "Creamos un gráfico de conocimiento con evidencias de publicaciones científicas sobre coronavirus. Los fármacos, las enfermedades, los genes y las proteínas están identificados y normalizados para permitir búsquedas complejas en los artículos.",
    "subheader": "Drugs4Covid extrae y estructura las pruebas de los artículos científicos en cinco pasos: Recoger, analizar, extraer, integrar y publicar. Prueba nuestras herramientas públicas.",
    "section1": {
      "title": "Recoger",
      "text": "En esta fase se recogen los datos. Utilizamos fuentes de información fiables para recuperar artículos científicos sobre coronavirus. <strong>El corpus CORD-19</strong> ha sido la principal base de datos utilizada en este estudio. La última actualización indexada es la de enero de 2022, con 334.572 artículos científicos y más de 7 millones de párrafos.",
      "btnText": "Ir al corpus"
    },
    "section2": {
      "title": "Analizar",
      "text": "Una de las tareas de minería de textos más fundamentales en la recuperación de información en el ámbito médico es el reconocimiento de entidades biomédicas, como <strong>enfermedades, sustancias químicas o genes</strong>, comúnmente conocidas como BioNER. Como complemento a este reconocimiento, hemos vinculado las entidades detectadas a <strong>bases de datos curadas</strong> en un proceso denominado vinculación o normalización de entidades BioNEN.",
      "btnText": "Ir a BioNER"
    },
    "section3": {
      "title": "Extraer",
      "text": "El uso combinado de tareas de procesamiento del lenguaje natural con técnicas de representación de palabras y tecnologías de extracción de conocimiento proporciona a los profesionales e investigadores clínicos herramientas que facilitan su trabajo de estructuración de la información contenida en los artículos. En particular, para establecer relaciones entre fármacos o enfermedades, y con el fin de mejorar las búsquedas en los corpus, hemos creado modelos de representación basados en <strong>tópicos probabilísticos</strong> capaces de abstraer entidades de sus formas textuales y relacionarlas entre sí.",
      "btnText": "Ir a BioSearch"
    },
    "section4": {
      "title": "Integrar",
      "text": "Para afrontar el reto de integrar el conocimiento biomédico en un único espacio de representación que además proporcione trazabilidad, hemos creado la ontología <strong>EBOCA</strong> donde se modela la Asociación de Conceptos Biomédicos.  La ontología describe y asocia conceptos del dominio biomédico, así como las evidencias que soportan estas asociaciones. Con esta ontología definimos el modelo conceptual sobre el que se construye el grafo de conocimiento Drugs4Covid.",
      "btnText": "Ir a EBOCA"
    },
    "section5": {
      "title": "Publicar",
      "text": "Hemos creado un sistema <strong>híbrido de pregunta-respuesta (QA</strong> ) basado en lenguaje natural que proporciona respuestas combinando información de grafos de conocimiento y documentos de texto. Se trata de un novedoso algoritmo KGQA que funciona sin entrenamiento previo y sin necesidad de traducir la pregunta a un lenguaje de consulta formal.",
      "btnText": "Ir a BioQA"
    }
  },

  "services": {
    "title": "Servicios",
    "header": "Este es un listado de los servicios disponibles en nuestra página web",
    "bioNER": {
      "title": "@:bioNER.title",
      "subtitle": "@:bioNER.subtitle",
      "text": "Un reconocedor de entidades con nombre (NER) biomédico que normaliza (NEN) los fármacos, enfermedades, genes y proteínas mencionados en los textos con los códigos de los principales sistemas de estandarización como MeSH, ICD-10, ATC, SNOMED, ChEBI, GARD y NCBI. Se basa en el ajuste del modelo lingüístico de BioBERT de forma independiente para cada tipo de entidad utilizando conjuntos de datos específicos del dominio y una búsqueda de índice inversa para normalizar las referencias.",
      "btnText": "Empezar a analizar"
    },
    "bioSearch": {
      "title": "@:bioSearch.title",
      "subtitle": "@:bioSearch.subtitle",
      "text": "Un servicio web abierto para explotar la literatura científica existente sobre coronavirus identificando fármacos, enfermedades y artículos y mostrando sus relaciones dentro del corpus. Se puede buscar por código ATC, nombre genérico, nombre de la enfermedad o código MESH.",
      "btnText": "Empezar a buscar"
    },
    "bioQA": {
      "title": "@:bioQA.title",
      "subtitle": "@:bioQA.subtitle",
      "text": "Un novedoso <strong>sistema de respuesta a preguntas (QA</strong> ) basado en preguntas en lenguaje natural que es independiente del dominio y permite la combinación de gráficos de conocimiento con fuentes de información no estructuradas para construir la respuesta. Combina <strong>DBPedia</strong> y <strong>Wikidata</strong> con la base de datos Drugs4Covid para proporcionar respuestas en lenguaje natural.",
      "btnText": "Empezar a preguntar"
    }
  },

  "bioNER": {
    "title": "Bio NER",
    "subtitle": "Encuentra las entidades biomédicas escodidas en el texto",
    "placeholder": "Introduce algún fragmento de texto para empezar a analizar",
    "description": "La herramienta BioNER aplica los ultimos modelos de reconocimiento de Entidades Biomèdicas: Enfermedades, Químicos, y Entidades Geneticas.",
    "resultsTitle": "Resultados",
    "tables": {
      "titles": {
        "disease": "Enfermedades",
        "chemicals": "Medicamentos/Químicos",
        "genetics": "Genéticos",
        "covid": "COVID-19"
      },
      "headers": {
        "associationScore": "COVID-19 Puntuación de Asociación",
        "atc": "ATC",
        "atcLevel": "Nivel ATC",
        "chebiId": "CHEBI ID",
        "cid": "CID",
        "crossReferences": "Otros IDs",
        "cui": "CUI",
        "ebiReference": "Referencia EBI",
        "evidence": "Evidencia",
        "foundTerm": "Término Encontrado",
        "icd10": "ICD10",
        "meshId": "Mesh ID",
        "ncbiTaxonId": "NCBItaxon ID",
        "ncbiGeneId": "NCBIgene ID",
        "prId": "PR ID",
        "semanticType": "Tipo Semántico",
        "target": "Objetivo",
        "term": "Término",
        "uniprotId": "UniProt ID"
      }
    }
  },

  "bioSearch": {
    "title": "Bio Search",
    "subtitle": "Busque sobre coronavirus entre toda la literatura científica",
    "placeholder": "Escribe al menos {numChar} caracteres para empezar a buscar"
  },

  "bioQA": {
    "title": "Bio QA",
    "subtitle": "Realiza cualquier pregunta a nuestro motor QA y selecciona el número de respuestas",
    "placeholder": "Escribe una pregunta",
    "subheader1": "Respuestas Máximas",
    "subheader2": "Base de datos",
    "d4c": "D4C",
    "dbPedia": "DB Pedia",
    "wikidata": "Wikidata"
  },

  "knowledgeGraph": {
    "title": "Grafo de Conocimiento",
    "header": "",
    "rdf": {
      "title": "RDF",
      "text": "El Grafo de Conocimiento de Drugs4Covid utiliza dos lenguajes de mapeo declarativo para transformar los datos de entrada en RDF: la recomendación W3C R2RML para EBOCA SEM-DISNET y RML para EBOCA Evidences. Ambos mapeos se crearon con Mapeathor y se materializaron usando el mapeo motor Morph-KGC.",      "btnText": "@:label.goTo Repository"
    },
    "sparql": {
      "title": "SPARQL",
      "text": "Se ha creado una interfaz web basada en el <strong>marco HELIO</strong> para acceder al gráfico de conocimiento de Drugs4Covid. Permite consultas en formato SPARQL y gestiona el acceso a los recursos a través de sus URIs.",      "btnText": "@:label.goTo SPARQL Endpoint"
    }
  },

  "corpus": {
    "title": "Corpus",
    "header": "",
    "textSearch": {
      "title": "Búsqueda Textual",
      "text": "Explotamos los modelos de reconocimiento de entidades y las representaciones tópicas probabilísticas de Drugs4Covid para proporcionar un <strong>motor de búsqueda</strong> basado en entidades biomédicas. Se han utilizado bases de datos adicionales para ampliar la información sobre medicamentos y relacionarla con otros términos. \n",
      "btnText": "Empezar a buscar"
    },
    "repository": {
      "title": "Repositorio",
      "text": "Soportado por Solr, hemos creado índices para cada una de las entidades biomédicas que pueden aportar evidencias",      "btnDiseases": "Diseases",
      "btnDrugs": "Medicamentos",
      "btnGenes": "Genes y Proteinas",
      "btnPapers": "Documenos",
      "btnParagraphs": "Parrafos"
    },
    "keyQ": {
      "title": "KeyQ",
      "text": "",
      "btnText": "@:label.goTo KeyQ"
    }
  },

  "textSearch": {
    "title": "Buscador de recursos guiado por palabras clave",
    "subtitle": "Escriba una o más palabras clave y seleccione el recurso para recuperar: texto, medicina o enfermedad.",    "placeholder": "Remdesivir",
    "subheader1": "Resultados Máximos",
    "subheader2": "Recursos",
    "subheader3": "Filtros",
    "diseases": "Enfermedades",
    "drugs": "Medicamentos",
    "texts": "Textos",
    "drugsFilter": "@:label.filterBy nivel ATC",
    "diseasesFilter": "@:label.filterBy nivel MESH",
    "tables": {
      "titles": {
        "drugs": "Medicamentos Relacionados",
        "diseases": "Enfermedades Relacionadas",
        "texts": "Textos Relacionados"
      },
      "headers": {
        "name": "Nombre",
        "code": "Código",
        "level": "Nivel",
        "frequency": "Frecuencia"
      }
    },
    "btnSource": "Ir a la Fuente"
  },

  "resources": {
    "title": "Recursos",
    "header": "",
    "code": {
      "title": "Código",
      "text": "Todos los recursos creados en Drugs4Covid son de código abierto y están disponibles públicamente. Hemos creado una organización en Github para centralizarlos. Siéntete libre de usarlos y déjanos tus comentarios para ayudarnos a seguir mejorando.",      "btnText": ""
    },
    "notebooks": {
      "title": "Cuadernos",
      "text": "Para facilitar el uso de nuestros recursos y acelerar las pruebas de concepto, también hemos creado <strong>cuadernos de Jupyter</strong> que están disponibles abiertamente.",      "btnText": "@:label.goTo Notebooks",
      "sources": {
        "cord19Indexing": {
          "title": "CORD-19 Indexing",
          "description": "Tareas de limpieza y preparación de texto para indexar artículos CORD-19 en Solr."
        },
        "atcProcessing": {
          "title": "ATC Processing",
          "description": "Recuperar información de medicamentos del sistema ATC en Solr."
        },
        "meshProcessing": {
          "title": "MeSH Processing",
          "description": "Recuperar información de medicamentos y enfermedades del sistema MeSH en Solr."
        }
      }
    },
    "annotatedCorpus": {
      "title": "Corpus Anotado",
      "text": "Hemos creado un corpus biomédico en español con doce entidades <strong>biomédicas</strong> (Enfermedad/Síndrome, Gen, Parte del Cuerpo/Órgano, Glúcido, Procedimiento Diagnóstico, Proteína, Procedimiento Terapéutico, Síntoma/Signo, Sustancia Farmacológica, Lípido, Organismo y Químico Orgánico), una entidad <strong>lingüística</strong> (Abreviatura/Sigla/Alias) y siete <strong>relaciones semánticas</strong> (analiza, altera, causa, diagnostica, manifestación_de, produce, refiere y trata). En total, se anotaron 200 informes clínicos, y se identificaron manualmente 6636 entidades biomédicas y 4864 relaciones semánticas.",      "btnText": "@:label.goTo Zenodo"
    }
  },

  "about": {
    "title": "Ontology Engineering Group (OEG)",
    "team": "Nuestro Equipo",
    "subtitle": "@:about.lab <br> @:about.faculty <br> @:about.university <br> @:about.address",
    "lab": "Laboratorio 3206",
    "faculty": "Escuela Técnica Superior de Ingenieros Informáticos (ETSIINF)",
    "university": "Universidad Politécnica de Madrid",
    "address": "Avda. Montepríncipe, s/n, Boadilla del Monte, 28660, Spain"
  }
}